## two dimensional array

In [3]:
import numpy as np

In [4]:
sample_matrix=np.array(([24,20,1,13],[33,55,66,11],[31,43,89,5]))
sample_matrix

array([[24, 20,  1, 13],
       [33, 55, 66, 11],
       [31, 43, 89,  5]])

In [5]:
sample_matrix[0][2]

1

## coinside value of 0th row and 2 col

In [9]:
sample_matrix[2,:]

array([31, 43, 89,  5])

## 2 is row and : col

In [10]:
sample_matrix[2]

array([31, 43, 89,  5])

In [11]:
sample_matrix[:,(2,3)]

array([[ 1, 13],
       [66, 11],
       [89,  5]])

## 2 col n 3 col

## selection techniques

In [14]:
sample_array=np.arange(1,20)

In [15]:
sample_array

array([ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15, 16, 17,
       18, 19])

In [16]:
sample_array

array([ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15, 16, 17,
       18, 19])

In [17]:
sample_array+sample_array

array([ 2,  4,  6,  8, 10, 12, 14, 16, 18, 20, 22, 24, 26, 28, 30, 32, 34,
       36, 38])

In [18]:
np.exp(sample_array)

array([2.71828183e+00, 7.38905610e+00, 2.00855369e+01, 5.45981500e+01,
       1.48413159e+02, 4.03428793e+02, 1.09663316e+03, 2.98095799e+03,
       8.10308393e+03, 2.20264658e+04, 5.98741417e+04, 1.62754791e+05,
       4.42413392e+05, 1.20260428e+06, 3.26901737e+06, 8.88611052e+06,
       2.41549528e+07, 6.56599691e+07, 1.78482301e+08])

In [19]:
np.sqrt(sample_array)

array([1.        , 1.41421356, 1.73205081, 2.        , 2.23606798,
       2.44948974, 2.64575131, 2.82842712, 3.        , 3.16227766,
       3.31662479, 3.46410162, 3.60555128, 3.74165739, 3.87298335,
       4.        , 4.12310563, 4.24264069, 4.35889894])

In [20]:
np.log(sample_array)

array([0.        , 0.69314718, 1.09861229, 1.38629436, 1.60943791,
       1.79175947, 1.94591015, 2.07944154, 2.19722458, 2.30258509,
       2.39789527, 2.48490665, 2.56494936, 2.63905733, 2.7080502 ,
       2.77258872, 2.83321334, 2.89037176, 2.94443898])

In [21]:
np.max(sample_array)

19

In [22]:
np.min(sample_array)

1

In [23]:
np.argmin(sample_array)

0

In [24]:
np.square(sample_array)

array([  1,   4,   9,  16,  25,  36,  49,  64,  81, 100, 121, 144, 169,
       196, 225, 256, 289, 324, 361], dtype=int32)

In [25]:
np.std(sample_array) ## standard devation

5.477225575051661

In [26]:
np.var(sample_array) ## variant

30.0

In [27]:
np.mean(sample_array) ## mean

10.0

In [28]:
array=np.random.randn(3,4)

In [29]:
array

array([[-1.24745723,  1.52539495,  1.24837772,  1.48560383],
       [ 0.80713975,  1.62345734,  0.23717804,  1.59288832],
       [-1.23557418, -1.44021287,  0.08144336, -0.58812984]])

In [32]:
np.round(array,decimals=4)

array([[-1.2475,  1.5254,  1.2484,  1.4856],
       [ 0.8071,  1.6235,  0.2372,  1.5929],
       [-1.2356, -1.4402,  0.0814, -0.5881]])

In [33]:
sports=np.array(['golf','fball','hockey','cricket'])
np.unique(sports)

array(['cricket', 'fball', 'golf', 'hockey'], dtype='<U7')

In [34]:
## pandas ->used to work with the data set

In [35]:
import pandas as pd
import numpy as np

In [58]:
labels=['w','x','y','z']
sample_list=[100,200,300,400]
array=np.array([1,2,3,4])
dict = {'w':10,'x':20,'y':30,'z':40}

In [59]:
pd.Series(data=sample_list)

0    100
1    200
2    300
3    400
dtype: int64

In [60]:
pd.Series(data=sample_list,index=labels)

w    100
x    200
y    300
z    400
dtype: int64

In [61]:
pd.Series(sample_list,labels)

w    100
x    200
y    300
z    400
dtype: int64

In [62]:
pd.Series(dict)

w    10
x    20
y    30
z    40
dtype: int64

## pandas dataframe

In [63]:
sports1=pd.Series([1,2,3,4],index=['cricket','football','baseball','golf'])
sports1

cricket     1
football    2
baseball    3
golf        4
dtype: int64

In [64]:
sports1['baseball']

3

In [69]:
sports2=pd.Series([11,2,3,4],index=['cricket','football','baseball','golf'])
sports2

cricket     11
football     2
baseball     3
golf         4
dtype: int64

In [68]:
sports1+sports2

cricket     12
football     4
baseball     6
golf         8
dtype: int64

In [70]:
df1=pd.DataFrame(np.random.randn(8,5),index='A B C D E F G H '.split(),columns='Score1 Score2 Score3 Score4 Score5'.split())
df1

     Score1    Score2    Score3    Score4    Score5
A -0.048794  0.193486 -0.964316  0.395795  0.400284
B -0.110436 -0.104339 -0.473320  0.958287 -1.590464
C  1.240077  0.812149 -0.249638  0.900844  0.895698
D  0.114907  0.126639  0.137272  0.897556  0.089343
E -0.778761  0.295893  0.895852  0.816030 -0.147880
F  0.462140 -0.054056 -1.789437 -0.517977 -1.564548
G -0.432963 -1.089888 -0.259322  1.823009  0.828434
H  0.844068 -1.085119  1.224588 -0.695346  0.232143

In [72]:
df1["Score5"]

A    0.400284
B   -1.590464
C    0.895698
D    0.089343
E   -0.147880
F   -1.564548
G    0.828434
H    0.232143
Name: Score5, dtype: float64

In [73]:
df1[["Score1","Score3","Score2"]]

     Score1    Score3    Score2
A -0.048794 -0.964316  0.193486
B -0.110436 -0.473320 -0.104339
C  1.240077 -0.249638  0.812149
D  0.114907  0.137272  0.126639
E -0.778761  0.895852  0.295893
F  0.462140 -1.789437 -0.054056
G -0.432963 -0.259322 -1.089888
H  0.844068  1.224588 -1.085119

In [74]:
df1['Score6']=df1['Score1']+df1['Score2']
df1

     Score1    Score2    Score3    Score4    Score5    Score6
A -0.048794  0.193486 -0.964316  0.395795  0.400284  0.144692
B -0.110436 -0.104339 -0.473320  0.958287 -1.590464 -0.214775
C  1.240077  0.812149 -0.249638  0.900844  0.895698  2.052226
D  0.114907  0.126639  0.137272  0.897556  0.089343  0.241546
E -0.778761  0.295893  0.895852  0.816030 -0.147880 -0.482868
F  0.462140 -0.054056 -1.789437 -0.517977 -1.564548  0.408084
G -0.432963 -1.089888 -0.259322  1.823009  0.828434 -1.522851
H  0.844068 -1.085119  1.224588 -0.695346  0.232143 -0.241051

In [76]:
df2={'ID':['100','101','102','103'],'Name':['John','Mercy','Yuva','Subhi'],'Profit':[20,77,80,90]}
df=pd.DataFrame(df2)
df

    ID   Name  Profit
0  100   John      20
1  101  Mercy      77
2  102   Yuva      80
3  103  Subhi      90

In [77]:
df["ID"]

0    100
1    101
2    102
3    103
Name: ID, dtype: object

In [78]:
df[["Name","Profit"]]

    Name  Profit
0   John      20
1  Mercy      77
2   Yuva      80
3  Subhi      90

In [79]:
df.drop("ID",axis=1)

    Name  Profit
0   John      20
1  Mercy      77
2   Yuva      80
3  Subhi      90

In [80]:
df.drop(2)

    ID   Name  Profit
0  100   John      20
1  101  Mercy      77
3  103  Subhi      90

In [81]:
## How to import datasets

In [83]:
import numpy as np
import pandas as pd

In [6]:
df=pd.read_csv("C:\Users\Dell\OneDrive\Documents\Book1.xlsx")

SyntaxError: (unicode error) 'unicodeescape' codec can't decode bytes in position 2-3: truncated \UXXXXXXXX escape (3165180417.py, line 1)